#------------------------------------------------------------------------------------------
# 함수와 면수 - 지역/전역 변수
#------------------------------------------------------------------------------------------
## 전역변수(Global Variable)
## - 파일(py) 내에 존제하며 모든곳에서 사용 가능
## - 프로그램 실행시 메모리 존제
## - 프로그렘 종료시 메모리에서 삭제
#------------------------------------------------------------------------------------------
name='홍길동'
tot=100
#------------------------------------------------------------------------------------------
## 지역변수(Global Variable)
## - 함수(function) 내에 존제하며 함수에서 사용 가능
## - 함수 실행시 메모리 존제
## - 함수 종료시 메모리에서 삭제
#------------------------------------------------------------------------------------------

#----------------------------------------------------------------------------------------
# 함수기능 : 정수를 덧셈한후 결과를 반환하는 함수
# 함수이름 : addInt
# 매개변수 : 0개 ~ N개 즉, 가변인자 *nums
# 함수결과 : 정수 result
#----------------------------------------------------------------------------------------
def addInt(*nums):
    tot=0
    for i in nums:
        tot+=i
    return tot
print(addInt(11,33,55,77))

def multiInt(*nums):
    tot1=1
    for i in nums:
        tot1*=i
    return tot1+tot
    
def multiInt2(*nums):
    # 전역변수의 값을 변경할 경우 그냥 사용 X
    global tot
    for i in nums:
        tot*=i
    return tot
## 함수 호출
result1=addInt(1)
print(result1)
result2=multiInt(5)
print(result2)
print(tot)
result3=multiInt2(5)
print(result3)
print(tot)