#------------------------------------------------------------------------------------------
# 제어문 - 반복문과 조건문 혼합
#------------------------------------------------------------------------------------------
## [실습]
## 숫자 1~50까지의 데이터가 있습니다.
## 해당 데이터에서 3의 배수는 제곱을 하고,
## 나머지 숫자는 그대로 해서 모두 더해서 합계를 출력하세요
#------------------------------------------------------------------------------------------
datas=range(1,51)
data=0
for i in datas:
    if i%3==0:
        data=data+(i**2)
    else:
        data=data+i
print(data)

#------------------------------------------------------------------------------------------
## [실습]
## 메시지에서 알파벳과 숫자를 구분해서 처리 합니다.
## 알파벳은 ★, 숫자는 ♡로 변경해서 출력해주세요.
#------------------------------------------------------------------------------------------
msg=input('알파벳은 ★, 숫자는 ♡로 변경 : ').strip()
msg2=''
for i in msg:
    if'a'<=i<='z'or'A'<=i<='Z':
        print('★',end='')
        msg2=msg2+'★'
    elif'0'<=i<='9':
        print('♡',end='')
        msg2=msg2+'♡'
    else:
        print(i,end='')
        msg2=msg2+i
print()
print(f'msg2 => {msg2}')