#------------------------------------------------------------------------------------------
# 제어문 - 반복문과 조건문 혼합
#------------------------------------------------------------------------------------------
## [실습]
## 메시지를 입력 받습니다.
## 알파벳 대문자인 경우 소문자로, 소문자인 경우 대문자로
## 나머지는 그대로 되도록 출력하기
#------------------------------------------------------------------------------------------
msg=input('대소문자 변환 : ').strip()
msg2=''
for i in msg:
    if'a'<=i<='z':
        print(chr(ord(i)-32),end='')
        msg2=msg2+(chr(ord(i)-32))
    elif'A'<=i<='Z':
        print(chr(ord(i)+32),end='')
        msg2=msg2+(chr(ord(i)+32))
    else:
        print(i,end='')
        msg2=msg2+i
print()
print(f'msg2=> {msg2}')