#------------------------------------------------------------------------------------------
# 제어문 - 반복문과 brake
# - 중첩 반복문일 경우의 brake는 가장 가까이 있는 밥복문만 종료
#------------------------------------------------------------------------------------------
## [실습] 단의 숫자만큼만 구구단을 출력하세요.
line=int(input())
for i in range(2,line+1):
    print()
    for j in range(1,10):
        if j==(i+1):
            break
        else:
            print(f'{j}*{i}={i*j:^2}',end='|')
# brake 빼면?
line=int(input())
for i in range(2,line+1):
    print()
    for j in range(1,i+1):
        print(f'{j}*{i}={i*j:^2}',end='|')
