#-------------------------------------------------------------------------------------------
# List/Set/Dict 자료형과 반복문, 조건부표현식 결합
# - 메모리 사용량 감소 & 속도 빠름
#-------------------------------------------------------------------------------------------
# [실습] A리스트의 데이터를 B리스트에 담기 단, A리스트에서 짝수값은 3을 곱하고,홀수값은 그대로 해서 B리스트에 담기
#-------------------------------------------------------------------------------------------
a=[1,2,3,4,5,6]
b=[]
for i in a:
    if i%2:
        b.append(i)
    else:
        b.append(i*3)
print(f'a=>{a}\nb=>{b}')
#-------------------------------------------------------------------------------------------
# [1] 모든 원소를 세로운 리스트에 담기 
# c=[]
# for i in a:
#     c.append(i)
c=[i for i in a]
print(f'a=>{a}\nb=>{b}\nc=>{c}')

#-------------------------------------------------------------------------------------------
# [2] 짝수 데이터만 세로운 리스트 C에 담기
# c=[]
# for i in a:
#     if not num%2: c.append(i*3)
c=[i*3 for i in a if not i%2]
print(f'a=>{a}\nb=>{b}\nc=>{c}')

#-------------------------------------------------------------------------------------------
# [3] 짝수 데이터는 3을 곱하고 홀수 데이터는 그대로 세로운 리스트 C에 담기
# c=[]
# for i in a:
#     if not i%2: c.append(i*3)
#     else: c.append(i)
c={i*3 if not i%2 else i for i in a}
print(f'a=>{a}\nb=>{b}\nc=>{c}')