#---------------------------------------------------------------------------------------------
# 제어문 - 반복문
#---------------------------------------------------------------------------------------------
## [실습] 문자열을 기계어 즉, 2진수로 변환하여 저장하기
# -[입력] Hello
# -[출력] 10010001100101110110011011001101111
#---------------------------------------------------------------------------------------------
msg=input('2진수로 변환할 문자 입력 : ').strip()
result=''
for i in msg:
    result=result+bin(ord(i))[2:]
    print(result)

#---------------------------------------------------------------------------------------------
## [실습] 원소/요소의 인덱스와 값을 함깨 가져오기
## enumerate()내장함수
## - 전달된 반복가능한 객체에서 뭔소당 번호를 부여해서 튜플로 묶어줌
## - 원소의 인덱스 정보가 필요한 경우 사용
#---------------------------------------------------------------------------------------------
nums=[1,3,5]

# 원소 데이터만 가져오기
for i in nums:print(i)

# enumerate() : 원소에 인덱싱 부여한 겍체 변환
print('enumerate() 변환 : ',list(enumerate(nums)))

# 인덱스와 원소 데이터 가져오기
for idx,i in enumerate(nums):
    print(idx,i)
for i in enumerate(nums):
    print(i[0],i[1])
    nums[i[0]]=int(i[1])