#---------------------------------------------------------------------------------------------------
# 연산자
#---------------------------------------------------------------------------------------------------
# [1] 산술연산자 ------------------------------------------------------------------------------------
# - 종류 : +, -, *, /, //, %, **
num1=int(input('1번정수 '))
num2=int(input('2번정수 '))

# 출력형태 : num1 + num2 = num1+num2
print(f'{num1} + {num2} = {num1+num2}')
print(f'{num1} - {num2} = {num1-num2}')
print(f'{num1} * {num2} = {num1*num2}')
print(f'{num1} / {num2} = {num1/num2}')
print(f'{num1} // {num2} = {num1//num2}')
print(f'{num1} % {num2} = {num1%num2}')
print(f'{num1} ** {num2} = {num1**num2}')

# [2] 비교연산자 ------------------------------------------------------------------------------------
# - 종류: >, <, >=, <=, ==, !=
num1='aF'
num2='ac'
print(f'{num1} > {num2} = {num1>num2}')
print(f'{num1} < {num2} = {num1<num2}')
print(f'{num1} >= {num2} = {num1>=num2}')
print(f'{num1} <= {num2} = {num1<=num2}')
print(f'{num1} == {num2} = {num1==num2}')
print(f'{num1} != {num2} = {num1!=num2}')