#----------------------------------------------------------------------------------------
# 함수(Function) 이해 및 활용
# 함수기반 계산기 프로그램
# - 4칙 연산 기능별 함수 생성 => 덧셈, 뺄셈, 곱셈,나눗셈
# - 2개 정수만 계산
#----------------------------------------------------------------------------------------

def add(num1,num2):
    return num1+num2
def sub(num1,num2):
    return num1-num2
def mul(num1,num2):
    return num1*num2
def dvi(num1,num2):
    return num1/num2 if not num2==0 else '0으로 나눌 수 없습니다.'
#----------------------------------------------------------------------------------------
# 함수기능 : 계산기 매뉴를 출력하는 함수
# 함수이름 : print_menu
# 매개변수 : 없음
# 함수결과 : 없음
#----------------------------------------------------------------------------------------
def print_menu():
    print(f'{"*":*^16}')
    print(f'*{"계 산 기":^11}*')
    print(f'{"*":*^16}')
    print(f'*{"1. 덧 셈":^12}*')
    print(f'*{"2. 뺄 셈":^12}*')
    print(f'*{"3. 곱 셈":^12}*')
    print(f'*{"4.나눗셈":^11}*')
    print(f'*{"5. 종 료":^12}*')
    print(f'{"*":*^16}')
#----------------------------------------------------------------------------------------
# 함수기능 : 함수호출
# 함수이름 : calc
# 매개변수 : 함수명, str 숫자2개
# 함수결과 : 없음
#----------------------------------------------------------------------------------------
def calc(func,data,op):
    if chech_data(data):
        data=data.split()
        print(f'결과{data[0]}{op}{data[1]}={func(int(num1),int(num2))}')
    else:print(f'{data}는 올바른 데이터가 아닙니다.')
#----------------------------------------------------------------------------------------
# 함수기능 : 데이터 유효성 검사함수
# 함수이름 : check_data
# 매개변수 : 함수명, str 숫자2개
# 함수결과 : 없음
#----------------------------------------------------------------------------------------
def chech_data(data):
    data=data.split()
    if len(data)==2 and data[0].isdecimal and data[1].isdecimal:
        return True
    else: return False

## 계산기 프로그램--------------------------------------------------------------------------
# - 사용자에게 원하는 계산을 선택하는 매뉴 출력
# - 종료매뉴선택시 프로그램 종료
#----------------------------------------------------------------------------------------
while True:
    print_menu()
    choice=int(input('매뉴 선택 :'))
    if choice==5:
        print('프로그램을 종료합니다.')
        break
    elif choice==1:
       num1,num2=input('정수 2개 입력:').split()
       calc(add,num1,num2,'+')
    elif choice==2:
       calc(sub,num1,num2,'-')
    elif choice==3:
       calc(mul,num1,num2,'*')
    elif choice==4:
       calc(dvi,num1,num2,'/')
    else:
        print('올바른 번호를 입력해주세요') 
