#---------------------------------------------------------------------------------------------
# Collection 자료형에 공통적인 부분 살펴보기
#---------------------------------------------------------------------------------------------
## [여러개의 변수에 데이터 저장]
# name='홍길동'
# age=12
# job='의적'
# gender='남'
#packing 타입 : 변수명=tuple타입
data='홍길동',12,'의적','남'
#---------------------------------------------------------------------------------------------
# unpacking 방식 : 변수1,변수2,...변수n = tuple1,tuple2,...tuple n <== 원소 갯수 중요!
name,age,job,gender='홍길동',12,'의적','남'
#---------------------------------------------------------------------------------------------

# name,age='홍길동',12,'의적','남'  <== ERROR!
print(name,age,job,gender)

name,age,_,_='홍길동',12,'의적','남' # <== 문법을 충족시키기위해 '_'사용 ('_'은 의미없는값에 자주사용!)
print(name,age,_) # <== '_'는 마지막값 출력

grade=[100,99]
kor,math=[100,99]
print(grade,kor,math)

person={'name':'박','age':11}
k1,k2={'name':'박','age':11}
print(person,k1,k2)

#---------------------------------------------------------------------------------------------
# 생성자(Constructor) 함수 : 타입명과 동일한 이름의 함수
# - int(), float(), str(), bool(), list(), tuyple(), dict(), set(), map(), range()
#---------------------------------------------------------------------------------------------
# 기본 데이터 타입
num=int(10)       # num=10
fnum=float(10.2)  # float=10.2
msg=str('Good')   # msg='good'
isOk=bool()       # isOk=False
print(num,fnum,msg,isOk)

# 컬랙션 타입
lnums=list([1,2,3,4])  #lnums=[1,2,3,4]
tnums=tuple((3,6,9))   #tnums=(3,6,9)
ds=dict({'d1':10,'d2':30})   #ds={'d1':10,'d2':30}
ss=set({1,1,3,3,5})    #ss={1,1,3,3,5}
print(lnums,tnums,ds,ss)

# 타입 변경 => 형변환
# dict 자료형은 다른 자료형과 달리 데이터 형태 다름
# - 데이터 형태 => 키:값
# - dict(키1=값,키2=값,....)
ds=dict(n1=1,n2=2,n3='남') #이 방식에서 key값은 str만 가능하며 ''사용X
print(ds)

ds=dict([('name','마징가'),('age',12)]) # tuple로 받으면 (key,value)로 치환
print(ds)

ds=dict([['name','마징가'],['age',12]]) # list로 받으면 [key,value]로 치환
print(ds)

## 내장함수 : zip() <= 같은 인덱스의 요소끼리 묶어줌
l1=['name','age','gender']
l2=['마징가',12,'남']
l3=[False,True,True]
print(list(zip(l1,l2,l3)))

ds=dict(zip(l1,l2))
print(ds)
