#------------------------------------------------------------------------------------------
# [실습] 임의의 숫자가 5의 배수 여부 결과를 출력하세요. 조건부 표현식으로 작성
#------------------------------------------------------------------------------------------
num=int(input('검사할 숫자 : ').strip())
print(f'{num}은 5의배수 입니다') if not num%5 else print(f'{num}은 5의배수가 아닙니다')

#------------------------------------------------------------------------------------------
# [실습] 문자열을 입력 받아서 문자열의 원소 개수를 저장
# - 단 원소 개수가 0이면 None 저장
# - (1) 입력받기 input()
# - (2) 원소/요소 개수 파악 len()
# - (3) 원소/요소 개수 저장 단, 0인 경우 None 저장하기
#------------------------------------------------------------------------------------------
msg=input('계산할 문자열 : ').strip()
result=len(msg) if len(msg) else None
print(f'{msg}의 원소 개수 : {result}')

#------------------------------------------------------------------------------------------
# [실습] 연산자와 숫자 2개 입력 받기
# - 입력된 연산자에 따라 계산 결과 저장
#------------------------------------------------------------------------------------------
simbol,num1,num2=input('사칙연산자와 연산할 숫자 2개 입력\n(예)+ 10 3) : ').split()
result=None
if simbol=='+':result=int(num1)+int(num2)
elif simbol=='-':result=int(num1)-int(num2)
elif simbol=='*':result=int(num1)*int(num2)
elif simbol=='/':result=int(num1)/int(num2)
else:print('조건에 맞는 연산식을 입력하십시오')
print(f'{num1} {simbol} {num2} = {result}')